{
  "start": "July 22, 2020",
  "title": "API request with Axios",
  "author": "Ricardo Moreira",
  "thumbnail": "https://res.cloudinary.com/mugas/image/upload/v1595401324/nasaapi_lgixoe.png",
  "excerpt": "Make a get request from Nasa API",
  "body": "Working with Apis can be a challenge but it's for sure something you want to work on and want to learn. \n\nBut I know(at least for me) when you start working/learning them it seems a total new world in top on the Javascript( in our case) world. There are so many APIs, some free, other no, some require some key others don't. Then how you get the data? You can go with Axios or fetch... So many options and way to do it that when you start you don't know where to start.\n\n**So let's get a small win.**  \n\nI will go back in the future to API with a full explanation of how to work with them, and all options. but for the sake of this post we only going to do some get requests and render them on the page using Axios. We do all that using [Nasa Api](https://api.nasa.gov/)\n\nSo this is what we will cover in this posts:\n\n* What is an API\n* How Axios Work\n* Make a get request\n* Render the data in the page\n* Hide Api keys\n\nSo ready to go to moon and back?\n\n## Links\n\n* [Project page](https://https://nasaapiaxios.netlify.app/)\n* [GitHub page](https://github.com/mugas/Movie-hero)\n* [Code Pen](https://codepen.io/collection/DrpKdj)\n* You also can read it [here](https://dev.to/mugas/flip-cards-with-javascript-2ad0) and [here](<>)\n\n## **What is an API?**\n\nAPI stands for Application Programming Interface and can be defined as what let's one application talk with another application.\n\nSo keeping it simple any type you share something from one site(app) to another you are in someway using an app. You have your website and want to display there all your posts in some social media app. How you do that? Yes with an API.\n\nAll around internet there are many companies, websites, governments that have their data available for you to access and they do that in an API.\n\n\n\nAdd Readme",
  "tags": [
    "javascript",
    "API"
  ]
}