{
  "start": "June 17, 2019",
  "title": "Loops with examples",
  "author": "Ricardo Moreira",
  "thumbnail": "https://res.cloudinary.com/mugas/image/upload/v1590573559/0_rrVomjfJRj96SVL__jsfkqt.jpg",
  "excerpt": "Start looping in javascript",
  "body": "**Loops** are something that is with us always since the beginning of our never-ending journey of learning JavaScript(or any programming language) so let’s focus on them. The best way for me to learn is creating something with what I am learning so I try to have examples for all the loops where you can see what they do and how we use them\n\n## What loops we will cover\n\n* while loop\n* do...while loop\n* for\n* for...in\n* for...of\n\nSo first let’s define what is a **loop** and why we need to use them in JavaScript?\\\nDo you know when you like a piece of music so much that you just listen to it over and over? Well, that is a loop. For programming, a loop is a way to iterate over something like an array or an object for example. With loops, we make sure our code is DRY. The **loop** will loop till the condition is met or loop if the condition is met and till the condition is false.\n\nAn infinite loop is a loop that has no ending and most likely it will crash your app/website.\n\n### **while loop**\n\nThe **while loop** it runs as long the condition evaluated is true. Think of it as a conditional, an ***if*** statement but instead of running once, run as long the condition is true.\\\nIf you don’t write the condition or write a condition that will never turn false, i.e, is always true the loop never ends.\n\n**Syntax**:\n\n```javascript\nwhile(condition)\n{\n  //code to be executed as long the condition is true\n}\n```\n\nLet’s print all number between 0 to 5:\n\n```javascript\nlet i = 0;\n  while (i < 6) {\n    console.log(i);\n    i++;\n  }\n```\n\nSo what is happening here? First, you set the variable to 0 outside the **loop**. Then you write the while condition that is `i < 6`, so as long *i* is less than 6 the code above is going to run.\\\nWhat is the code? Everything that is inside the brackets, so in this case, the printing the variable( the number) and then add one to that variable.\n\nSo it starts at 0. Zero less than 6? Yes, so print *i* that is 0 and add 1. After how much is *i*? Yes, it’s 1, still lower than 6 so do it again till *i* is 6. Because 6 is not smaller than 6 the **loop** ends and what is printed is:\n\n```javascript\nlet i = 0;\n  while (i < 6  ) {\n    console.log(i);\n    i++;\n  }\n  /*\n  0\n  1\n  2\n  3\n  4\n  5 \n  */\n```\n\n### Let’s get real\n\nFor me, the best way to learn is seeing the practicability of the situation/problem, in this case, the loop. I will try to be the most practical I can but feel free to tell me if I am not being to clear or how can I improve. This is is just a small example, I would say it’s nothing that will never be needed at least like this:) It’s New Year eve and you want to create a small 10 seconds countdown and till 0 or till it’s New year say how many seconds to New Year Eve and when reach 0 it will say “Happy New Year”.\n\n<p class=\"codepen\" data-height=\"265\" data-theme-id=\"dark\" data-default-tab=\"html,result\" data-user=\"mugas\" data-slug-hash=\"eowVJW\" data-preview=\"true\" style=\"height: 265px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;\" data-pen-title=\"While loop\">\n  <span>See the Pen <a href=\"https://codepen.io/mugas/pen/eowVJW\">\n  While loop</a> by Ricardo (<a href=\"https://codepen.io/mugas\">@mugas</a>)\n  on <a href=\"https://codepen.io\">CodePen</a>.</span>\n</p>\n<script async src=\"https://static.codepen.io/assets/embed/ei.js\"></script>\n\n<p class=\"codepen\" data-height=\"265\" data-theme-id=\"dark\" data-default-tab=\"html,result\" data-user=\"mugas\" data-slug-hash=\"eowVJW\" style=\"height: 265px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;\" data-pen-title=\"While loop\">\n  <span>See the Pen <a href=\"https://codepen.io/mugas/pen/eowVJW\">\n  While loop</a> by Ricardo (<a href=\"https://codepen.io/mugas\">@mugas</a>)\n  on <a href=\"https://codepen.io\">CodePen</a>.</span>\n</p>\n<script async src=\"https://static.codepen.io/assets/embed/ei.js\"></script>\n\nSo what happened here? I will not get into details about the DOM Manipulation but basically, we set a id in our html then in our js `const message = document.querySelector(\"#container\")` and there is where we will display our message `message.innerHTML=`${countdown}`. Also, I’m using template literals.\nNow the <b>while loop</b>. We set the variable <i>seconds</i> to 10 that is where we want to start it, then we set the variable <i>countdown</i> to an empty string where we will print in JS the countdown.\nThen our <b>while statement</b> says that as long the seconds variable is bigger than 0 we write the message and set the variable seconds to decrease one second.\nAfter we just set when it reaches zero. So is outside the loop`countdown =${countdown} ${seconds} Happy new Year`. So the <i>const</i> message will display the countdown variable during the countdown and show accordingly the message.\n\n### **do...while loop**\n\nThe **do…while** works a bit different. The big difference is that the **do… while** loop runs at least once. Basically, it says to do something while this condition is true running always at least once.\n\n**Syntax**:\n\n```javascript\ndo\n  //statement or code to execute\nwhile(condition)\n```\n\nNow let’s see a situation where it only runs once:\n\n```javascript\nlet i = 0;\ndo {\n  i++;\n  console.log(`I run at least ${i} times`);\n} while (i < 0);\nconsole.log(`I run a total of ${i} times`);\n// expected result: \"I run at least 1 time\"\n// \"I run a total of 1 times\"\n```\n\nWe set the variable to **0** and set the loop to add one to each time it iterates and to do it (*set the condition to*) as long i is less than zero. I put a console.log inside the statement and another outside to see what it prints.\n\nSo first **i** is 0, and we add one and print “I run at least 1 time”. Then we check the condition: is i less than 0? Well, **i** now is 1 and is bigger than 0 so the loop stop and it will print “I run a total of 1 time.\\\nIf you want to see the difference change the condition to 5 for example\n\n```javascript\nlet i = 0;\ndo {\n  i++;\n  console.log(`I run at least ${i} times`);\n} while (i < 5);\nconsole.log(`I run a total of ${i} times`);\n/* expected result:\n\"I run at least 1 time\"\n\"I run at least 2 time\"\n\"I run at least 3 time\"\n\"I run at least 4 time\"\n\"I run at least 5 time\"\n\"I run a total of  5 times\"*/\n```\n\nHere you can see how it works when it loops more than once. The i starts with 0 then we add 1, it becomes 1. it prints “I run at least one time”. Then because I is still less than 5 adds one more and do the same till I is 5 and then prints all is above.\n\n### **for loop**\n\nOne of the most used loops in JavaScript is the **for loop**. When I start coding with JS, this was one of the ones I used more till today. In the beginning, I was not getting so much how it works so I try to explain in a way that I would understand when I started\\\nIn the for loop, the code is repeated until the condition evaluates to false. **One of the uses of the for loop is to loop over an array**.\n\n**Syntax**:\n\n```javascript\nfor([initialization];[condition]; [final-expression])\n```\n\nSo when in use, would be looking something like this:\n\n```javascript\nfor(let i =0; i <5 ; i++){\n    //do something\n}\n```\n\nTo explain first let’s go to a simple example. You want to loop all numbers from 0 to 4 and print them, the loop above will be the one to use.\n\nSo the initialization (**i=0**) is where we define a variable, because we want to start at 0 we define the variable as 0.\n\nThe condition(**i<5**) is the expression that at the end of each loop is evaluated and when it becomes false the loop stops. So in this case, in each loop, it’s checked if i is **less than 5**.\n\nThe final expression(**i++**) normally is used as an increment. What you have to take into account is that the final expression occurs before the condition is evaluated\n\nThe **//do something** part is the code that it will run as long the condition (i<5) is true.\\\nIn the for loop, you can use the break or continue statement.\n\nSo let’s see a more realistic example. You have a website where you want to add movies that you saw and display them on screen.\\\nFirst, in our html let’s create our div where we will represent our movies.\n\n```javascript\n<h1>Movies I see</h1>\r\n      <div id=\"movies\"></div>\n```\nIn our js, we create the array with the movies that we can add more or delete.\n```javascript\nlet movies = [\r\n  \"Constant Gardener\",\r\n  \"Batman\",\r\n  \"Pulp Fiction\",\r\n  \"Heat\",\r\n  \"Godfather\"\r\n];\n```\nNow let’s get our div from our html with a `getElementById`:\n\n```javascript\nlet myMovies = document.getElementById(\"movies\");\n```\nThen we create an empty string where we going to render all the movies.\n```javascript\nlet myList = \"\";\n```\nNow we want to loop over the movies that we have and we can create that with the for a loop.\n\n```javascript\nfor (let i = 0; i < 5; i++) {\r\n    console.log(movies[i]);\r\n  }\n```\nSo what happens in the loop? First, we create a variable and set to 0. Why 0? To start in our first element. If we change it to 1, you will see that it will not print the movie “Constant Gardner”. After we set the condition that is, to print while i is less than 5. Why 5 ? because is the number of movies we have. Then we add `i++` to add always one to each loop. Then we just need to add what we want in each loop and in this case we just want to console.log it — We write `movies[i]` to write each movie separated. If you would write only\r `console.log(movies);`\n\nIt would print the array of movies 5 times, and not the 5 movies.\r\nAnd what can we do to improve it? Well, what if you want to add another movie? You had to change the condition to `i<6` and 7 if you had another and so on. And that isn’t really productive. So let’s make it dynamic.\r\nWe want that it loops till the variable that we are using to loop <b>(i)</b> is less than the number of movies right? And in programming the number of elements in an array ( number of movies in this example) is the <b>length</b> of the array so we can write the code like this:\n\n```javascript\nfor (let i = 0; i < movies.length; i++) {\r\n    console.log(movies[i]);\r\n  }\n```\nAnd just like that, we don’t need to worry if we add another movie because it will loop always.\r\nNow let’s also render in the screen. We can do it by creating a bullet point in each time it loops.\n\n```javascript\nfor (let i = 0; i < movies.length; i++) {\r\n    console.log(movies[i]);\r\n    myList = myList + `<li>${movies[i]}</li>`;\r\n  }\n```\nWhat we did here? So the myList was an empty string, right? So in each loop, we want that inside our empty string will be an element of the array while we loop in that string.\r\nTo make the code better let’s wrap everything around a function\n\n```javascript\nfunction myMovies() {\r\n  let myMovies = document.getElementById(\"movies\");\r\n  let myList = \"\";\r\n  for (let i = 0; i < movies.length; i++) {\r\n    console.log(movies[i]);\r\n    myList = myList + `<li>${movies[i]}</li>`;\r\n  }\r\n  myMovies.innerHTML = `${myList}`;\r\n}\r\nmyMovies();\n```\nNow we just create the HTML element with the function we created and render the data that is on the myList.\n\n<p class=\"codepen\" data-height=\"265\" data-theme-id=\"dark\" data-default-tab=\"html,result\" data-user=\"mugas\" data-slug-hash=\"QRPEpy\" style=\"height: 265px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;\" data-pen-title=\"For loop\">\r\n  <span>See the Pen <a href=\"https://codepen.io/mugas/pen/QRPEpy\">\r\n  For loop</a> by Ricardo (<a href=\"https://codepen.io/mugas\">@mugas</a>)\r\n  on <a href=\"https://codepen.io\">CodePen</a>.</span>\r\n</p>\r\n<script async src=\"https://static.codepen.io/assets/embed/ei.js\"></script>\n\n\n\n",
  "tags": [
    "javascript"
  ]
}