{
  "start": "June 22, 2020",
  "title": "Start with Api by doing Nasa APIS",
  "author": "Ricardo Moreira",
  "excerpt": "With Nasa API",
  "body": "So, now that we now how to include Axios and work around it, let's do out first get request to show in our page.\n\nNasa has plenty of APIs and we going to use some of them. One of the most known is the [picture of the day](https://apod.nasa.gov/apod/).\n\nTo focus more on the API, I will not spend to much time on the CSS or html but I try to make some explanation when I feel its necessary.\n\n```html\n <figure class=\"daily-image\">\r\n   <figcaption></figcaption>\r\n </figure>\n```\n\n```css\nimg {\r\n  width: 100%;\r\n  height: 400px;\r\n}\r\n\r\n.daily-image {\r\n  text-align: center;\r\n}\n```\n\n```js\nconst imageOfTheDay = document.querySelector(\".daily-image\");\n```\n\nSo here we are only \"setting the table\". In our html, we set where er going to have the picture, with our css we set the image size and position. Then in our javascript we get the element where we going to put the image with `document.querySelector`.\n\n[Here](https://api.nasa.gov/) we get all the api's from Nasa and the info and there by going to **Browse APIs** and choose **APOD** we see the HTTP Request. For this example we use the Demo Key. We can set it straigth in the link like this `https://api.nasa.gov/planetary/apod?api_key=DEMO_KEY` but we are going to use as parameters to see how to use them.\n\n```js\nconst getImageOfTheDay = () => {\r\n  axios\r\n    .get(\"https://api.nasa.gov/planetary/apod?\", {\r\n      params: {\r\n        api_key: \"DEMO_KEY\",\r\n      },\r\n    })\r\n    .then((response) => {\r\n      console.log(response);\r\n      imageOfTheDay.insertAdjacentHTML(\r\n        \"beforeend\",\r\n        `<img src=${response.data.hdurl}>`\r\n      );\r\n    });\r\n};\r\n\r\ngetImageOfTheDay();\n```\n\nMany things happening here right? Let's go step by step.\nFirst we set the axios with the API from Nasa that I mentioned above. As we learn before, we set the params inside curly brackets and put the api_key in it. As you can see in the website of the API, besides that query you can use also, get an iamge from an specific date or set the image with high resolution.\n\nAfter that we set the response. We already get the element we want to get so we only need to use the `insertAdjacentHtml`(I set it to \"beforeend\") and put the image tag with the source we want. If you are wondering how or why there is the `response.data.url`, I also console.log the `response`for us to analyze.\n",
  "tags": [
    "api"
  ]
}