{
  "start": "June 17, 2019",
  "title": "Loops with examples",
  "author": "Ricardo Moreira",
  "thumbnail": "https://res.cloudinary.com/mugas/image/upload/v1590573559/0_rrVomjfJRj96SVL__jsfkqt.jpg",
  "excerpt": "Start looping in javascript",
  "body": "**Loops** are something that is with us always since the beginning of our never-ending journey of learning JavaScript(or any programming language) so let’s focus on them. The best way for me to learn is creating something with what I am learning so I try to have examples for all the loops where you can see what they do and how we use them\n\n## What loops we will cover\n\n* while loop\n* do...while loop\n* for\n* for...in\n* for...of\n\nSo first let’s define what is a **loop** and why we need to use them in JavaScript?\\\nDo you know when you like a piece of music so much that you just listen to it over and over? Well, that is a loop. For programming, a loop is a way to iterate over something like an array or an object for example. With loops, we make sure our code is DRY. The **loop** will loop till the condition is met or loop if the condition is met and till the condition is false.\n\nAn infinite loop is a loop that has no ending and most likely it will crash your app/website.\n\n\n\n### **while loop**\n\n\n\nThe **while loop** it runs as long the condition evaluated is true. Think of it as a conditional, an ***if*** statement but instead of running once, run as long the condition is true.\\\nIf you don’t write the condition or write a condition that will never turn false, i.e, is always true the loop never ends.\n\n**Syntax**:\n\n```javascript\nwhile(condition)\n{\n  //code to be executed as long the condition is true\n}\n```\n\nLet’s print all number between 0 to 5:\n\n```javascript\nlet i = 0;\n  while (i < 6) {\n    console.log(i);\n    i++;\n  }\n```\n\n\n\nSo what is happening here? First, you set the variable to 0 outside the **loop**. Then you write the while condition that is `i < 6`, so as long *i* is less than 6 the code above is going to run.\\\nWhat is the code? Everything that is inside the brackets, so in this case, the printing the variable( the number) and then add one to that variable.\n\nSo it starts at 0. Zero less than 6? Yes, so print *i* that is 0 and add 1. After how much is *i*? Yes, it’s 1, still lower than 6 so do it again till *i* is 6. Because 6 is not smaller than 6 the **loop** ends and what is printed is:\n\n```javascript\nlet i = 0;\n  while (i < 6  ) {\n    console.log(i);\n    i++;\n  }\n  /*\n  0\n  1\n  2\n  3\n  4\n  5 \n  */\n```\n\n### Let’s get real\n\n<p class=\"codepen\" data-height=\"265\" data-theme-id=\"dark\" data-default-tab=\"result\" data-user=\"mugas\" data-slug-hash=\"mZVRQb\" style=\"height: 265px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;\" data-pen-title=\"for...of\">\r\n  <span>See the Pen <a href=\"https://codepen.io/mugas/pen/mZVRQb\">\r\n  for...of</a> by Ricardo (<a href=\"https://codepen.io/mugas\">@mugas</a>)\r\n  on <a href=\"https://codepen.io\">CodePen</a>.</span>\r\n</p>\r\n<script async src=\"https://static.codepen.io/assets/embed/ei.js\"></script>",
  "tags": [
    "javascript"
  ]
}