{
  "title": "My Wes Bos 30",
  "thumbnail": "https://res.cloudinary.com/mugas/image/upload/v1596697709/Javascript30_phcsrt.jpg",
  "about": "Javascript, css",
  "author": "Ricardo Moreira",
  "body": "# **What it is?**\n\nAfter I finished the Wes Bos [course](https://beginnerjavascript.com/) about Javacript I decided to revist his free [course](https://javascript30.com/) and try to add my own take on his projects.\nThe first time I did the 30 days of Javascript I had created my own versions of some of his projects(more on than on the detailed explanation of each project) but mostly all of I took them as a new project. So I created some set of rules for it\n\n\n## Rules\n\n Normally I dedicate an hour and a half per day( Monday to Friday) to a course. \n\n* The transformation of Wes Bos project had to be taken in that time frame, meaning after I end up a lesson, I have an hour and a half max to change the project to my own vision. \n* Every day I have to start a new lesson/project\n* The transformations have to do with the topics of the lesson\n* It had to include in some way, more javascript or at least change the existent one.\n\n## Links\n\n* [Project page](https://mytakeonjs30.netlify.app/)\n* [GitHub page](https://github.com/mugas/MyWes30)\n\n## Project by Project\n\n### Drumkit\n\nThis was love at first sight but because of that, I think it blocked my thoughts.\nAfter I saw the project for the first time, so many ideas start running to my head that when I want to put them on practice I couldn't.\nThen I just end up adding more buttons with different sounds.\n\n#### What changed?\n\n* Only add more buttons with different sounds on each one.\n* Change the background image\n\n#### Links\n\n* [Original](https://wesdrumkit.netlify.app/)\n* [GitHub page](https://mydrumkit30.netlify.app/)\n\n### Clock\n\nThis is here but is not included in the challenge. That is because I did this the first time I check this course. Because I never worked with libraries in the time, I wanted to add some date library. So I spent some time doing this one 2 years ago.After I finished I decided to add some animations and create a adversting for stop smoking.\n\n#### What changed?\n\n* Add date library(moment.js)\n* Change the clock to have also the digital version \n* It shows the numbers of the hours\n* Add animations to swing the clock\n\n#### Links\n\n* [Original](https://wesclock.netlify.app/)\n* [GitHub page](https://myclock30.netlify.app/)\n\n### CSS Variables\n\nOne hour and a half seems to much but when you start coding, it just goes to fast and you realize you end up doing nothing.\nI added more pictures because I wanted to see how it works with many pictures at the same time. After I also had the possibility to add the width as a variable but that was not really changing or adding any Javascript. So after some reading about it, I end up adding a different cursor with css variables.\n\n#### What changed?\n\n* Add more pics instead of one\n* User can also change the width of the picture\n* The cursor has a colored circle made with css variables\n\n#### Links\n\n* [Original](https://wescssvariables.netlify.app/)\n* [GitHub page](https://mycssvariables.netlify.app/)\n\n### Flex Panels\n\nFirst time I saw it, I picture it a perfect project for a restaurant or events page but I decided to keep the pictures and start playing with more classes and animations with the letters and the images\n\n#### What changed?\n\n* The text shows a gradient animation\n* All pictures feature a grayscale that only disappears when pressed on the panel\n\n\n#### Links\n\n* [Original](https://wesflexpanel.netlify.app/)\n* [GitHub page](https://myflexpanel.netlify.app/)\n\n\n\n\n",
  "excerpt": "My take on Wes Bos 30"
}